=====================================
Import statements
=====================================

import a, b
import b/c as d
import a/b/[c, d]

---

(module
  (import_statement
    (slashed_name (identifier))
    (slashed_name (identifier)))
  (import_statement
    (slashed_name (identifier) (identifier))
    (id_or_str (identifier)))
  (import_statement
    (slashed_name (identifier) (identifier) (identifier_list (identifier) (identifier)))))

=====================================
Import-from statements
=====================================

from a import b
from a import b, c
from a/b import c
from a as b import `c`

---

(module
  (import_from_statement
    (slashed_name (identifier))
    (id_or_str (identifier)))
  (import_from_statement
    (slashed_name (identifier))
    (id_or_str (identifier))
    (id_or_str (identifier)))
  (import_from_statement
    (slashed_name (identifier) (identifier))
    (id_or_str (identifier)))
  (import_from_statement
    (slashed_name (identifier))
    (id_or_str (identifier))
    (id_or_str (string))))

=====================================
Echo statements
=====================================

echo a
echo b, c
echo 0 or 1, 1 or 0,
echo 0 or 1

---

(module
  (omit_parens_statement (identifier) (identifier))
  (omit_parens_statement (identifier) (identifier) (identifier))
  (omit_parens_statement (identifier)
    (operator (integer) (op) (integer))
    (operator (integer) (op) (integer)))
  (omit_parens_statement (identifier)
    (operator (integer) (op) (integer))))


=====================================
Expression statements
=====================================

a
b + c

---

(module
  (expression_statement (identifier))
  (expression_statement (operator (identifier) (op) (identifier))))


=====================================
If statements
=====================================

if a:
  b
  c
when not defined(release):
  echo "hi"

---

(module
  (generic_statement
    (identifier)
    (identifier)
    body: (block
      (expression_statement (identifier))
      (expression_statement (identifier))))
  (generic_statement (identifier)
    (operator (op) right: (call function: (identifier) arguments: (argument_list (identifier))))
    body: (block (omit_parens_statement (identifier) argument: (string)))))


====================================================
Comments
====================================================

echo a
# hi
echo b # bye
echo c

---

(module
  (omit_parens_statement (identifier) (identifier))
  (comment)
  (omit_parens_statement (identifier) (identifier))
  (comment)
  (omit_parens_statement (identifier) (identifier)))

====================================================
Comments at different indentation levels
====================================================

if a:
  # one
# two
    # three
  b
    # four
  c

---

(module
  (generic_statement (identifier) (identifier)
    (comment)
    (comment)
    (comment)
    (block
      (expression_statement (identifier))
      (comment)
      (expression_statement (identifier)))))

====================================================
Comments after dedents
====================================================

if a:
  b

# one
c

---

(module
  (generic_statement (identifier)
    (identifier)
    (block
      (expression_statement (identifier))))
  (comment)
  (expression_statement (identifier)))

====================================================
Newline tokens followed by comments
====================================================

echo "a"
  # We need to recognize the newline *preceding* this comment, because there's no newline after it
---

(module (omit_parens_statement (identifier) (string)) (comment))

=====================================
Declaration statements
=====================================

let a = 1
let a: int = 1
var a: int
var
  a = 1
  b = 2
  c: int = 3
  d: string
  e =
    when defined(release):
      1
    else:
      2
  f = hello()
const a = "hello"

---

(module
  (expression_statement (declaration (block (assignment (identifier) (op) (block (expression_statement (integer)))))))
  (expression_statement (declaration (block (decl (identifier) (type (identifier)) (op) (block (expression_statement (integer)))))))
  (expression_statement (declaration (block (decl (identifier) (type (identifier))))))
  (expression_statement (declaration (block
    (assignment (identifier) (op) (block (expression_statement (integer))))
    (assignment (identifier) (op) (block (expression_statement (integer))))
    (decl (identifier) (type (identifier)) (op) (block (expression_statement (integer))))
    (decl (identifier) (type (identifier)))
    (assignment (identifier) (op) (block
      (generic_statement (identifier) (call (identifier) (argument_list (identifier)))
        (block (expression_statement (integer))))
      (generic_statement (identifier) (block (expression_statement (integer))))))
    (assignment (identifier) (op) (block (expression_statement (call (identifier) (argument_list))))))))
  (expression_statement (declaration (block (assignment (identifier) (op) (block (expression_statement (string))))))))

